Вариант 3, задания	(15, 9).
Задание 1 (15).	Написать функцию генерации случайного email адреса формата <name>@<domen>.<local>.
Задание 1 (9).	Написать функцию, которая объединяет два одномерных массива в один, состоящих только из элементов входящих в первый массив.
Задание 2. Составить список учебной группы, включающий Х человек. Для каждого студента указать: фамилию и имя, дату рождения (год, месяц и число), также у каждого студента есть зачетка, в которой указаны: предмет (от трех до пяти), дата экзамена, ФИО преподавателя. 3.	Вывод виде таблицы предмета и оценки определенного студента.
